Model Specific Parameters      Value     
_________________________________________________________________
NAME                           catdog    
NB_EPOCH                       50        
STEPS_PER_EPOCH                5         
VALIDATION_STEPS               2         
BATCH_SIZE                     20        
VERBOSE                        1         
OPTIMIZER                      RMSprop(lr=1e-4)
LOSS                           binary_crossentropy
METRICS                        acc       
NB_CLASSES                     --        
N_HIDDEN                       --        
VALIDATION_SPLIT               --        
DROPOUT                        --        
RESHAPED                       --        
Found 102 images belonging to 2 classes.
Found 100 images belonging to 2 classes.
Deep Learning Model Architecture...
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 148, 148, 32)      896       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 74, 74, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 72, 72, 64)        18496     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 36, 36, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 34, 34, 128)       73856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 17, 17, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 15, 15, 128)       147584    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6272)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               3211776   
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 513       
=================================================================
Total params: 3,453,121
Trainable params: 3,453,121
Non-trainable params: 0
_________________________________________________________________
